# ============================================================================
# Brewfile - Setup Completo macOS Silicon
# Versão: 1.0.0
# Data: 2025-12-01
# Sistema: macOS Silicon (Tahoe 26.0.1)
# ============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

# ============================================================================
# FERRAMENTAS DE DESENVOLVIMENTO
# ============================================================================

# Version Control
brew "git"
brew "gh"                    # GitHub CLI
brew "git-lfs"              # Git Large File Storage

# Linguagens e Runtimes
brew "node@20"               # Node.js LTS
brew "python@3.12"           # Python
brew "go"                    # Go
brew "rust"                  # Rust

# Build Tools
brew "cmake"
brew "pkg-config"
brew "make"

# ============================================================================
# FERRAMENTAS CLI ESSENCIAIS
# ============================================================================

brew "curl"
brew "wget"
brew "jq"                    # JSON processor
brew "yq"                    # YAML processor
brew "fzf"                   # Fuzzy finder
brew "ripgrep"               # rg - grep melhorado
brew "fd"                    # find melhorado
brew "bat"                   # cat melhorado
brew "exa"                   # ls melhorado
brew "zoxide"                # cd inteligente
brew "starship"              # Prompt shell moderno
brew "htop"                  # Monitor de processos
brew "btop"                  # Monitor sistema moderno

# ============================================================================
# SEGURANÇA E SECRETS
# ============================================================================

brew "1password-cli"         # 1Password CLI
brew "gpg"                   # GPG encryption
brew "pass"                  # Password manager CLI

# ============================================================================
# APPS ESSENCIAIS (CASKS)
# ============================================================================

# Produtividade e Launcher
cask "raycast"               # Launcher principal
cask "alfred"                # Alternativa Raycast (opcional)

# Editores e IDEs
cask "visual-studio-code"    # VS Code
cask "cursor"                # Cursor IDE
cask "sublime-text"          # Editor rápido
cask "vim"                    # Editor terminal

# Terminal
cask "iterm2"                # Terminal moderno
cask "warp"                   # Terminal moderno alternativo

# Navegação de Arquivos
cask "forklift"              # File manager dual-pane
cask "path-finder"           # Finder avançado

# Gerenciamento de Janelas
cask "rectangle"             # Window management (gratuito)
cask "magnet"                 # Window management (pago)
cask "alt-tab"                # Alt+Tab como Windows

# Automação
cask "keyboard-maestro"       # Automação avançada
cask "hazel"                  # Automação de arquivos
cask "shortcuts"              # Atalhos macOS

# Monitoramento
cask "istat-menus"           # Monitor sistema completo
cask "monitorcontrol"         # Controle de monitores

# Cloud e Sincronização
cask "dropbox"               # Cloud storage
cask "google-drive"          # Google Drive
cask "onedrive"              # OneDrive

# Comunicação
cask "slack"                 # Comunicação equipe
cask "discord"               # Comunicação
cask "zoom"                  # Video conferência
cask "teams"                 # Microsoft Teams

# Navegadores
cask "google-chrome"         # Chrome
cask "firefox"               # Firefox
cask "brave-browser"        # Brave
cask "arc"                   # Arc browser

# ============================================================================
# FERRAMENTAS DE DESENVOLVIMENTO
# ============================================================================

# Containers e Virtualização
cask "docker"                # Docker Desktop
cask "orbstack"              # Docker alternativo (mais leve)
cask "vagrant"               # Virtualização
cask "utm"                   # Virtualização macOS

# Banco de Dados
cask "postgres-unofficial"   # PostgreSQL
cask "tableplus"             # Database client
cask "sequel-ace"            # MySQL client
cask "mongodb-compass"       # MongoDB client
cask "redis-insight"         # Redis client

# API e Testes
cask "postman"               # API testing
cask "insomnia"              # API client alternativo
cask "httpie"                # HTTP client CLI

# ============================================================================
# FERRAMENTAS DE IA E ML
# ============================================================================

cask "ollama"                # LLM local
cask "lm-studio"             # LLM Studio

# ============================================================================
# DESIGN E MÍDIA
# ============================================================================

cask "figma"                 # Design
cask "sketch"                # Design
cask "adobe-creative-cloud"  # Adobe Suite
cask "gimp"                  # Editor imagem gratuito
cask "imageoptim"            # Otimização imagens

# ============================================================================
# FONTES
# ============================================================================

cask "font-fira-code"        # Font para código
cask "font-jetbrains-mono"   # Font JetBrains
cask "font-meslo-lg-nerd-font" # Font Nerd Fonts

# ============================================================================
# OUTRAS FERRAMENTAS ÚTEIS
# ============================================================================

cask "the-unarchiver"        # Descompactar arquivos
cask "cheatsheet"           # Ver atalhos de teclado
cask "cleanmymac"           # Limpeza sistema
cask "little-snitch"         # Firewall
cask "bartender"             # Organizar menu bar
cask "hiddenbar"            # Esconder menu bar (gratuito)
